StephenGit597/STM32F103C8_Header_Files/STM32F103C8_ADC.h
//ADC_JSQR 1 2 3 4 JL[1:0]:Inject_Length (config_num)<<5
/*ADCX ADC1-1 ADC2-2
CHX Injected Channel
num 优先数字
*/
static inline void ADC_Set_ADCx_JSQR_Channel_Priority(unsigned char ADCX,unsigned char CHX,unsigned char num)
{
    switch(ADCX)
    {
        case 1:
        {
            if(CHX<5)
            {
                ADC1->ADC1_JSQR = ADC1->ADC1_JSQR&~(0x0000001F<<(CHX-1)*5);
                ADC1->ADC1_JSQR = ADC1->ADC1_JSQR|(num<<(CHX-1)*5);
            }
            else
            {
                break;
            }
            break;
        }
        case 2:
        {
            if(CHX<5)
            {
                ADC2->ADC2_JSQR = ADC2->ADC2_JSQR&~(0x0000001F<<(CHX-1)*5);
                ADC2->ADC2_JSQR = ADC2->ADC2_JSQR|(num<<(CHX-1)*5);
            }
            else
            {
                break;
            }
            break;
        }
        default:
        {
            break;
        }
    }
}
/*ADCX ADC1-1 ADC2-2
Total_num 总数
*/
static inline void ADC_Set_ADCx_JSQR_Num(unsigned char ADCX,unsigned char Total_num)
{
    switch(ADCX)
    {
        case 1:
        {
            ADC1->ADC1_JSQR = ADC1->ADC1_JSQR&~(0x00300000);
            ADC1->ADC1_JSQR = ADC1->ADC1_JSQR|(Total_num<<20);
            break;
        }
        case 2:
        {
            ADC2->ADC2_JSQR = ADC2->ADC2_JSQR&~(0x00300000);
            ADC2->ADC2_JSQR = ADC2->ADC2_JSQR|(Total_num<<20);
            break;
        }
        default:
        {
            break;
        }
    }
}

#endif